[
    {
        "member_name": "Alex Moen",
        "manager": "Dillon",
        "membership": [
            "Peptide Membership"
        ],
        "tests": [],
        "medications": [
            {
                "name": "BPC-157",
                "description": "BPC-157 Therapy offers cutting-edge treatment designed to support healing, recovery, and overall wellness.",
                "indication": "BPC-157 therapy promotes tissue repair, reduces inflammation, and enhances recovery from injuries or physical strain."
            },
            {
                "name": "Hexarelin",
                "description": "Hexarelin is a peptide designed to stimulate the release of growth hormone, promoting muscle growth, fat reduction, and faster recovery. With its potent regenerative effects, Hexarelin is a versatile peptide for those seeking improved physical performance and resilience.",
                "indication": "Hexarelin strengthens connective tissues, supports joint health, and may improve cardiovascular function by promoting cardiac repair and protection. Known for its ability to enhance strength and energy, Hexarelin is commonly used for anti-aging, athletic performance, and injury recovery."
            },
            {
                "name": "TB-400 / TB-500",
                "description": "TB-400/500 is a synthetic fragment of thymosin beta-4 (specifically the 17-23 segment), designed to replicate its active region. Both are involved in actin regulation and tissue repair. TB-500 Therapy provides advanced treatment designed to enhance recovery, promote healing, and support overall physical performance.",
                "indication": "TB-400/500 therapy helps reduce inflammation, accelerate tissue repair, and improve endurance, making it an ideal choice for those seeking optimal recovery and resilience."
            },
            {
                "name": "Tesamorelin",
                "description": "A peptide therapy that boosts natural growth hormone production.",
                "indication": "Achieve targeted fat loss and enhanced metabolic health with Tesamorelin. Known for its ability to reduce stubborn visceral fat, it supports improved body composition, muscle definition, and energy."
            }
        ],
        "supplements": [],
        "timestamp": "2025-12-09T15:55:40.277055"
    },
    {
        "member_name": "Lisa Freeland",
        "manager": "Dillon",
        "membership": [],
        "tests": [
            {
                "name": "GI-MAP + Zonulin",
                "shopify_url": "https://www.1stoptimal.shop/collections/featured-test-kits",
                "description": "An advanced stool test providing a comprehensive assessment of gut microbiome health, including pathogens, inflammation markers, and intestinal permeability (zonulin).",
                "indication": "Ideal for those addressing gut issues, digestive health, or immune function concerns."
            },
            {
                "name": "DUTCH Complete™ Test",
                "description": "The DUTCH Complete™ Test (Dried Urine Test for Comprehensive Hormones) is an advanced hormone panel that provides a detailed analysis of sex hormones, adrenal function, and their metabolites. Using dried urine samples collected over a 24-hour period, this test offers a comprehensive assessment of hormonal balance, metabolism, and overall endocrine health. It measures cortisol patterns, sex hormones, melatonin, and organic acid markers to provide insights into stress response, hormone detoxification, and overall well-being.",
                "indication": "The DUTCH Complete™ Test is indicated for individuals experiencing symptoms related to hormone imbalance, adrenal dysfunction, and metabolic concerns, including fatigue, mood swings, weight fluctuations, irregular menstrual cycles, low libido, and sleep disturbances. It is particularly beneficial for assessing adrenal health, evaluating estrogen metabolism, and monitoring hormone therapy. This test provides actionable insights for optimizing hormonal balance, improving stress resilience, and enhancing overall wellness."
            },
            {
                "name": "DUTCH Cycle Mapping Panel",
                "shopify_url": "https://www.1stoptimal.shop/collections/womens-health-and-hormone-panels",
                "description": "A comprehensive hormone test that tracks fluctuations throughout the menstrual cycle, offering insights into estrogen and progesterone patterns.",
                "indication": "Ideal for those addressing irregular cycles, fertility concerns, or hormonal imbalances."
            }
        ],
        "medications": [],
        "supplements": [],
        "timestamp": "2025-12-09T15:59:00.631683"
    }
]