{
    "Men": {
        "Total Testosterone": {
            "description": "This powerhouse hormone drives muscle growth, energy, and vitality. Optimizing it boosts strength, stamina, and focus. Too low, you’re sluggish and moody; too high, irritability spikes. Keep it dialed with heavy lifts, protein-rich steak, and 7-9 hours of sleep.",
            "clinical_range": "264 - 916",
            "optimal_range": "600 - 1400",
            "units": "ng/dL",
            "panel": "Hormone, Gonadotropin & Neurosteroid Panel"
        },
        "Free Testosterone": {
            "description": "The unbound T fueling muscle and energy. Optimal levels supercharge recovery and drive. Low leaves you dragging; high might spark aggression. Stay steady with compound lifts, zinc (oysters), and deep rest.",
            "clinical_range": "6.8 - 21.5",
            "optimal_range": "18.0 -27.0",
            "units": "ng/dL",
            "panel": "Hormone, Gonadotropin & Neurosteroid Panel"
        },
        "Estradiol": {
            "description": "This estrogen cousin supports bones and libido. Optimizing it strengthens joints and steadies mood. Too low, fatigue and brittleness hit; too high, bloat creeps in. Balance it with training, lean meats, and sleep.",
            "clinical_range": "7.6 - 42.6",
            "optimal_range": "7.6 - 55.0",
            "units": "pg/mL",
            "panel": "Hormone, Gonadotropin & Neurosteroid Panel"
        },
        "Sex Hormone Binding Globulin (SHBG)": {
            "description": "SHBG regulates T and E availability. Optimal levels sharpen muscle and energy gains. Too high, T’s locked up; too low, chaos reigns. Keep it in check with weights, magnesium (nuts), and avoiding sugar spikes.",
            "clinical_range": "16.5 - 55.9",
            "optimal_range": "16.5 - 55.9",
            "units": "nmol/L",
            "panel": "Hormone, Gonadotropin & Neurosteroid Panel"
        },
        "Prolactin": {
            "description": "This hormone balances mood and vitality. Optimizing it lifts focus and stamina. High kills drive; low drags you down. Manage it with stress relief, vitamin B6 (chicken), and rest.",
            "clinical_range": "3.6 - 31.5",
            "optimal_range": "3.6 - 12.0",
            "units": "ng/mL",
            "panel": "Hormone, Gonadotropin & Neurosteroid Panel"
        },
        "Luteinizing Hormone (LH)": {
            "description": "LH signals testes to pump T. Optimal levels fuel gains and vigor. Too low, lifts falter; too high might strain you. Boost it with squats, hearty meals, and sleep.",
            "clinical_range": "1.7 - 8.6",
            "optimal_range": "1.7 - 6.0",
            "units": "mIU/mL",
            "panel": "Hormone, Gonadotropin & Neurosteroid Panel"
        },
        "Follicle-Stimulating Hormone (FSH)": {
            "description": "FSH drives sperm production and vitality. Optimizing it enhances recovery and robustness. Low stalls energy; high signals stress. Support it with lifts, omega-3s (salmon), and rest.",
            "clinical_range": "1.5 - 12.4",
            "optimal_range": "1.5 - 12.4",
            "units": "mIU/mL",
            "panel": "Hormone, Gonadotropin & Neurosteroid Panel"
        },
        "Dehydroepiandrosterone Sulfate (DHEA-S)": {
            "description": "This precursor feeds T and E production. Optimal levels lift endurance and mood. Too low, you’re wiped; too high, restlessness hits. Keep it up with deadlifts, healthy fats (coconut oil), and sleep.",
            "clinical_range": "102.6 - 416.3",
            "optimal_range": "300.0 - 500.0",
            "units": "ug/dl",
            "panel": "Hormone, Gonadotropin & Neurosteroid Panel"
        },
        "Prostate Specific Antigen (PSA)": {
            "description": "The prostate’s gym log tracks health down there. Optimizing it ensures smooth function and peace of mind; levels naturally rise with age due to prostate growth. Age-specific reference ranges can be useful: 40-49 years: 0-2.5 ng/ml, 50-59 years: 0-3.5 ng/ml, 60-69 years: 0-4.5 ng/ml, 70+ years: 0-6.5 ng/ml. Slightly high? Could be from epic sex, biking, or inflammation—not always trouble. High spikes might feel off; too low’s rare but subtle. Keep it chill with regular lifts, clean eats, and 7-9 hours of sleep.",
            "clinical_range": "0.0 - 4.0",
            "optimal_range": "0.6 - 2.0",
            "units": "ng/ml",
            "panel": "Hormone, Gonadotropin & Neurosteroid Panel"
        },
        "TSH": {
            "description": "TSH controls thyroid metabolism. Optimizing it torches fat and powers energy. Too low, you’re sluggish; too high, jitters hit. Fuel it with cardio, iodine (seaweed), and rest.",
            "clinical_range": "0.45 - 4.5",
            "optimal_range": "1.0 - 2.0",
            "units": "µIU/mL",
            "panel": "Thyroid, Growth Factors & Glucose"
        },
        "Free T3": {
            "description": "The thyroid’s active hype man revs energy. Optimal levels boost fat-burning and stamina. Low leaves you cold; high makes you wired. Tune it with sprints, selenium (Brazil nuts), and sleep.",
            "clinical_range": "2.0 - 4.4",
            "optimal_range": "3.5 - 4.8",
            "units": "pg/mL",
            "panel": "Thyroid, Growth Factors & Glucose"
        },
        "Free T4": {
            "description": "This thyroid fuel steadies metabolism. Optimizing it sustains energy and recovery. Too low, you’re slow; too high, muscles waste. Support it with yoga, seafood, and rest.",
            "clinical_range": "0.82 - 1.77",
            "optimal_range": "0.82 - 1.77",
            "units": "ng/dL",
            "panel": "Thyroid, Growth Factors & Glucose"
        },
        "Insulin-Like Growth Factor I (IGF-1)": {
            "description": "IGF-1 turbocharges muscle growth. Optimal levels speed gains and resilience. Low stalls progress; high might overtax you. Stack it with heavy lifts, protein shakes, and sleep.",
            "clinical_range": "125 - 300",
            "optimal_range": "250 - 400",
            "units": "ng/ml",
            "panel": "Thyroid, Growth Factors & Glucose"
        },
        "HbA1c": {
            "description": "This tracks long-term sugar control. Optimizing it keeps energy steady and fat off. High crashes you; low saps stamina. Stay lean with intervals, greens (broccoli), and rest.",
            "clinical_range": "4.8 - 5.6",
            "optimal_range": "4.8 - 5.2",
            "units": "%",
            "panel": "Thyroid, Growth Factors & Glucose"
        },
        "Fasting Insulin": {
            "description": "Insulin manages sugar for lean gains. Optimal levels sharpen metabolism. Too high, fat piles on; too low, you’re shaky. Keep it tight with lifts, fiber (lentils), and sleep.",
            "clinical_range": "2.6 - 24.9",
            "optimal_range": "2.6 - 10.0",
            "units": "uIU/mL",
            "panel": "Thyroid, Growth Factors & Glucose"
        },
        "Vitamin D (25-OH)": {
            "description": "The sunshine vitamin builds bones and immunity. Optimizing it boosts power and fights fatigue. Low leaves you achy; high feels off. Soak it up with sun, fatty fish (mackerel), and rest.",
            "clinical_range": "30 - 100",
            "optimal_range": "60 - 80",
            "units": "ng/mL",
            "panel": "Thyroid, Growth Factors & Glucose"
        },
        "Glutamyl Transferase (GGT)": {
            "description": "GGT detoxes the liver for a clean machine. Optimal levels enhance recovery and vitality. High signals stress; low’s subtle. Protect it with cardio, antioxidants (berries), and minimal booze.",
            "clinical_range": "9.0 - 48.0",
            "optimal_range": "9.0 - 25.0",
            "units": "ng/mL",
            "panel": "Thyroid, Growth Factors & Glucose"
        },
        "Glucose": {
            "description": "Blood sugar fuels your grind. Optimizing it sustains energy without dips. Too low, you’re woozy; too high, sluggishness hits. Steady it with cardio, balanced carbs (quinoa), and sleep.",
            "clinical_range": "70 - 99",
            "optimal_range": "70 - 85",
            "units": "mg/dL",
            "panel": "Thyroid, Growth Factors & Glucose"
        },
        "Calcium": {
            "description": "This mineral fortifies bones and nerves. Optimal levels mean unbreakable lifts. Low cramps you; high might stiffen. Stack it with weights, dairy (yogurt), and rest.",
            "clinical_range": "8.5 - 10.5",
            "optimal_range": "8.5 - 10.5",
            "units": "mg/dL",
            "panel": "Metabolic Panel"
        },
        "Sodium": {
            "description": "Sodium keeps hydration and pumps on point. Optimizing it powers endurance. Too low, cramps strike; too high, bloat hits. Balance it with lifts, electrolyte drinks, and hydration.",
            "clinical_range": "135 - 145",
            "optimal_range": "135 - 145",
            "units": "mmol/L",
            "panel": "Metabolic Panel"
        },
        "Potassium": {
            "description": "Potassium drives muscle and heart rhythm. Optimal levels mean strong lifts. Low tires you; high throws you off. Load it with sprints, bananas, and sleep.",
            "clinical_range": "3.5 - 5.0",
            "optimal_range": "3.5 - 5.0",
            "units": "mmol/L",
            "panel": "Metabolic Panel"
        },
        "Chloride": {
            "description": "Chloride balances pH for stamina. Optimizing it keeps recovery tight. Too low or high, you’re weak. Steady it with training, broth, and rest.",
            "clinical_range": "10.0 - 20.0",
            "optimal_range": "98 - 107",
            "units": "mmol/L",
            "panel": "Metabolic Panel"
        },
        "Carbon Dioxide (CO₂), Total": {
            "description": "CO₂ reflects acid-base balance. Optimal levels sustain breathing and endurance. Off-kilter, you’re foggy. Keep it smooth with deep breathing, hydration, and sleep.",
            "clinical_range": "22 - 29",
            "optimal_range": "22 - 29",
            "units": "mmol/L",
            "panel": "Metabolic Panel"
        },
        "Blood Urea Nitrogen (BUN)": {
            "description": "BUN gauges kidney cleanup. Optimizing it ensures a lean system. High wears you out; low might mean underfueling. Stay optimal with lifts, water, and rest.",
            "clinical_range": "7.0 - 20.0",
            "optimal_range": "7.0 - 20.0",
            "units": "mg/dL",
            "panel": "Metabolic Panel"
        },
        "Creatinine": {
            "description": "This tracks muscle waste and kidney health. Optimal levels support gains. High feels heavy; low’s rare. Keep it steady with training, hydration, and sleep.",
            "clinical_range": "0.6 - 1.3",
            "optimal_range": "0.6 - 1.3",
            "units": "mg/dL",
            "panel": "Metabolic Panel"
        },
        "BUN/Creatinine Ratio": {
            "description": "This ratio fine-tunes kidney function. Optimizing it keeps waste clearance sharp. Off-balance, you’re sluggish. Balance it with lifts, balanced protein, and rest.",
            "clinical_range": "10.0 - 20.0",
            "optimal_range": "10.0 - 20.0",
            "units": ":1 (Ratio)",
            "panel": "Metabolic Panel"
        },
        "Total Protein": {
            "description": "Total protein fuels repair and power. Optimal levels speed recovery. Too low, you’re frail; too high, strain hits. Boost it with weights, eggs, and sleep.",
            "clinical_range": "6.0 - 8.3",
            "optimal_range": "6.0 - 8.3",
            "units": "g/dL",
            "panel": "Metabolic Panel"
        },
        "Albumin": {
            "description": "Albumin balances blood fluids. Optimizing it prevents swelling and boosts endurance. Low leaks energy; high’s rare. Keep it up with lifts, whey, and rest.",
            "clinical_range": "3.5 - 5.0",
            "optimal_range": "3.5 - 5.0",
            "units": "g/dL",
            "panel": "Metabolic Panel"
        },
        "Globulin, Total": {
            "description": "Globulins bolster immunity. Optimal levels fight bugs and keep you strong. Too low, you’re sick-prone; too high, inflammation flares. Support it with training, broth, and sleep.",
            "clinical_range": "2.0 - 3.5",
            "optimal_range": "2.0 - 3.5",
            "units": "g/dL",
            "panel": "Metabolic Panel"
        },
        "Albumin/Globulin (A/G) Ratio": {
            "description": "This protein balance aids recovery. Optimizing it enhances repair. Off-kilter, you’re slow to rebound. Maintain it with lifts, balanced protein, and rest.",
            "clinical_range": "1.0 - 2.5",
            "optimal_range": "1.0 - 2.5",
            "units": "Ratio",
            "panel": "Metabolic Panel"
        },
        "Total Bilirubin": {
            "description": "Bilirubin checks liver cleanup. Optimal levels mean steady energy. High drains you; low’s subtle. Keep it clean with cardio, greens, and sleep.",
            "clinical_range": "0.1 - 1.2",
            "optimal_range": "0.1 - 1.2",
            "units": "mg/dL",
            "panel": "Metabolic Panel"
        },
        "Alkaline Phosphatase": {
            "description": "This enzyme tracks bone and liver health. Optimizing it strengthens frames. Too low, bones weaken; too high, fatigue hits. Stay optimal with weights, kale, and rest.",
            "clinical_range": "44 - 147",
            "optimal_range": "44 - 147",
            "units": "IU/L",
            "panel": "Metabolic Panel"
        },
        "Aspartate Aminotransferase (AST)": {
            "description": "AST monitors liver and muscle. Optimal levels mean clean function. High tires you; low’s fine. Protect it with training, turmeric, and sleep.",
            "clinical_range": "10.0 - 40.0",
            "optimal_range": "10.0 - 25.0",
            "units": "IU/L",
            "panel": "Metabolic Panel"
        },
        "Alanine Aminotransferase (ALT)": {
            "description": "ALT zeroes in on liver health. Optimizing it keeps detox smooth. High slows you; low’s no issue. Maintain it with lifts, Brussels sprouts, and rest.",
            "clinical_range": "7.0 - 56.0",
            "optimal_range": "7.0 - 26.0",
            "units": "IU/L",
            "panel": "Metabolic Panel"
        },
        "Estimated Glomerular Filtration Rate (eGFR)": {
            "description": "eGFR measures kidney filtration. Optimal levels clear waste for gains. Low drags you; high’s not a worry. This is not a more is better scenario anything over the minimum is fine. Keep it flowing with training, water, and sleep.",
            "clinical_range": "60 - 150",
            "optimal_range": "80 - 140",
            "units": "mL/min/1.73 m²",
            "panel": "Metabolic Panel"
        },
        "White Blood Cell (WBC) Count": {
            "description": "WBCs fight infections. Optimizing them keeps you tough. Too low, bugs win; too high, inflammation flares. Boost it with lifts, zinc seeds, and rest.",
            "clinical_range": "4500 - 11000",
            "optimal_range": "4500 - 11000",
            "units": "cells/µL",
            "panel": "CBC w/ Differential and Platelet"
        },
        "Red Blood Cell (RBC) Count": {
            "description": "RBCs haul oxygen for endurance. Optimal levels power sets. Low leaves you winded; high thickens blood. Support it with training, spinach, and sleep.",
            "clinical_range": "4.2 - 5.9",
            "optimal_range": "4.9 - 5.9",
            "units": "million cells/µL",
            "panel": "CBC w/ Differential and Platelet"
        },
        "Hemoglobin (Hgb)": {
            "description": "Hemoglobin carries O₂ for stamina. Optimizing it lifts energy. Too low, you’re weak; too high, sluggishness hits. Keep it strong with lifts, beef, and rest.",
            "clinical_range": "13.8 - 17.2",
            "optimal_range": "13.8 - 17.2",
            "units": "g/dL",
            "panel": "CBC w/ Differential and Platelet"
        },
        "Hematocrit (Hct)": {
            "description": "Hematocrit measures blood thickness. Optimal levels mean pump perfection. Low saps stamina; high feels heavy. Balance it with training, hydration, and sleep.",
            "clinical_range": "35.9 - 50.4",
            "optimal_range": "41.5 - 50.4",
            "units": "%",
            "panel": "CBC w/ Differential and Platelet"
        },
        "Mean Corpuscular Volume (MCV)": {
            "description": "MCV sizes red blood cells. Optimizing it ensures O₂ flow. Off-balance, you’re tired. Maintain it with lifts, B12 fish, and rest.",
            "clinical_range": "80 - 100",
            "optimal_range": "80 - 100",
            "units": "fL",
            "panel": "CBC w/ Differential and Platelet"
        },
        "Mean Corpuscular Hemoglobin (MCH)": {
            "description": "MCH tracks hemoglobin per cell. Optimal levels fuel power. Low weakens you; high’s rare. Boost it with training, liver, and sleep.",
            "clinical_range": "27.0 - 32.0",
            "optimal_range": "27.0 - 32.0",
            "units": "pg",
            "panel": "CBC w/ Differential and Platelet"
        },
        "Mean Corpuscular Hemoglobin Concentration (MCHC)": {
            "description": "MCHC measures hemoglobin density. Optimizing it keeps blood strong. Off-kilter, you’re dragging. Keep it steady with lifts, vitamin C (oranges), and rest.",
            "clinical_range": "32 - 36",
            "optimal_range": "32 - 36",
            "units": "%",
            "panel": "CBC w/ Differential and Platelet"
        },
        "Red Cell Distribution Width (RDW)": {
            "description": "RDW checks RBC variety. Optimal levels mean consistent energy. High tires you; low’s steady. Optimize with training, folate beans, and sleep.",
            "clinical_range": "11.0 - 15.0",
            "optimal_range": "11.0 - 15.0",
            "units": "%",
            "panel": "CBC w/ Differential and Platelet"
        },
        "Platelet Count": {
            "description": "Platelets aid clotting and recovery. Optimizing them speeds healing. Too low, you bruise; too high, clotting risks rise. Support it with lifts, kale, and rest.",
            "clinical_range": "150000 - 400000",
            "optimal_range": "180000 - 350000",
            "units": "cells/µL",
            "panel": "CBC w/ Differential and Platelet"
        },
        "Mean Platelet Volume (MPV)": {
            "description": "MPV sizes platelets for balance. Optimal levels keep recovery smooth. Off-kilter, inflammation hits. Maintain it with training, omega-3s (flax), and sleep.",
            "clinical_range": "7.0 - 9.0",
            "optimal_range": "7.0 - 9.0",
            "units": "fL",
            "panel": "CBC w/ Differential and Platelet"
        },
        "Neutrophils": {
            "description": "Neutrophils battle germs. Optimizing them keeps you tough. Too low, infections strike; too high, stress flares. Boost it with lifts, zinc (pumpkin seeds), and rest.",
            "clinical_range": "50 - 70",
            "optimal_range": "50 - 70",
            "units": "%",
            "panel": "CBC w/ Differential and Platelet"
        },
        "Lymphocytes": {
            "description": "Lymphocytes defend immunity. Optimal levels mean resilience. Low leaves you sick; high signals strain. Support it with training, vitamin C (peppers), and sleep.",
            "clinical_range": "18 - 42",
            "optimal_range": "18 - 42",
            "units": "%",
            "panel": "CBC w/ Differential and Platelet"
        },
        "Monocytes": {
            "description": "Monocytes clean infections. Optimizing them keeps you strong. Too low, bugs linger; too high, inflammation spikes. Keep it steady with lifts, blueberries, and rest.",
            "clinical_range": "3.5 - 9.0",
            "optimal_range": "3.5 - 9.0",
            "units": "%",
            "panel": "CBC w/ Differential and Platelet"
        },
        "Eosinophils": {
            "description": "Eosinophils tackle allergies. Optimal levels mean calm vibes. High brings sniffles; low’s fine. Maintain it with training, clean eats, and sleep.",
            "clinical_range": "1.0 - 3.0",
            "optimal_range": "1.0 - 2.6",
            "units": "%",
            "panel": "CBC w/ Differential and Platelet"
        },
        "Basophils": {
            "description": "Basophils handle rare immune tasks. Optimizing them keeps balance. High signals inflammation; low’s fine. Steady it with lifts, lean protein, and rest.",
            "clinical_range": "0.0 - 2.0",
            "optimal_range": "0.0 - 2.0",
            "units": "%",
            "panel": "CBC w/ Differential and Platelet"
        },
        "Total Cholesterol": {
            "description": "This fat fuels hormones and heart health. Optimal levels boost energy. Too low, you’re flat; too high, pipes clog. Optimize with training, nuts, and sleep.",
            "clinical_range": "100 - 199",
            "optimal_range": "100 - 170",
            "units": "mg/dL",
            "panel": "Lipid Panel"
        },
        "HDL": {
            "description": "HDL clears junk as ‘good’ cholesterol. Optimizing it sharpens stamina. Low drags you; high’s a win. Boost it with cardio, olive oil, and rest.",
            "clinical_range": "39.0 - 120.0",
            "optimal_range": "60.0 - 120.0",
            "units": "mg/dL",
            "panel": "Lipid Panel"
        },
        "LDL (calculated)": {
            "description": "LDL, the ‘bad’ cholesterol, can clog pipes. Optimal levels keep energy up. High slows you; low’s rare. Keep it low with lifts, oats, and sleep.",
            "clinical_range": "0 - 129",
            "optimal_range": "0- 99",
            "units": "mg/dL",
            "panel": "Lipid Panel"
        },
        "Triglycerides": {
            "description": "Triglycerides store energy. Optimizing them keeps you lean. High piles fat; low saps fuel. Maintain it with training, fish oil, and rest.",
            "clinical_range": "0 - 149",
            "optimal_range": "0 - 100",
            "units": "mg/dL",
            "panel": "Lipid Panel"
        },
        "VLDL (calculated)": {
            "description": "VLDL hauls triglycerides. Optimal levels mean clean blood. High bogs you; low’s fine. Keep it steady with lifts, lean meats, and sleep.",
            "clinical_range": "05 - 40",
            "optimal_range": "05 - 15",
            "units": "mg/dL",
            "panel": "Lipid Panel"
        },
        "Total Cholesterol/HDL Ratio": {
            "description": "This ratio gauges heart risk. Optimizing it lifts vigor. High tires you; low’s a champ. Balance it with cardio, chia, and rest.",
            "clinical_range": "0.0 - 5.0",
            "optimal_range": "0.0 - 3.5",
            "units": "ratio",
            "panel": "Lipid Panel"
        },
        "LDL/HDL Ratio": {
            "description": "This cholesterol showdown affects arteries. Optimal levels mean strength. High slows you; low’s smooth. Optimize with training, nuts, and sleep.",
            "clinical_range": "0.0 - 5.0",
            "optimal_range": "0.0 - 2.0",
            "units": "ratio",
            "panel": "Lipid Panel"
        },
        "Apolipoprotein B": {
            "description": "ApoB counts risky particles. Optimizing it cuts heart risk and boosts endurance. High drags stamina; low’s a win. Stay optimal with cardio, avocado, and rest.",
            "clinical_range": "0.0 - 90",
            "optimal_range": "0.0 - 90",
            "units": "mg/dL",
            "panel": "Lipid Panel"
        },
        "Apolipoprotein A": {
            "description": "ApoA powers HDL’s cleanup. Optimizing it sharpens heart health and energy. Low weakens you; high’s a bonus. Boost it with lifts, fatty fish, and sleep.",
            "clinical_range": "0.0 - 30.0",
            "optimal_range": "0.0 - 30.0",
            "units": "mg/dL",
            "panel": "Lipid Panel"
        },
        "Total Testosterone (LC/MS) [uncapped]": {
            "description": "The T-test for titans tracks high levels accurately. Optimizing it fuels max strength and recovery. Low saps gains; high might overrev you. Keep it jacked with presses, steak, and rest.",
            "clinical_range": "264 - 916",
            "optimal_range": "600 - 1400",
            "units": "ng/dL",
            "panel": "Hormone, Gonadotropin & Neurosteroid Panel"
        },
        "Free Testosterone (Equilibrium Ultrafiltration) [uncapped]": {
            "description": "Free T’s true measure unleashes power. Optimal levels amp muscle and drive. Low cages you; high might push too hard. Boost it with rows, protein, and sleep.",
            "clinical_range": "6.8 - 21.5",
            "optimal_range": "18.0 -27.0",
            "units": "ng/dL",
            "panel": "Hormone, Gonadotropin & Neurosteroid Panel"
        },
        "Estradiol, Sensitive / Ultrasensitive (LC/MS)": {
            "description": "This sniper test tracks E for TRT precision. Optimizing it steadies mood and bones. Too high, bloat hits; too low, energy tanks. Dial it with lifts, clean eats, and rest.",
            "clinical_range": "8.0 - 35.0",
            "optimal_range": "20.0 - 30.0",
            "units": "pg/mL",
            "panel": "Hormone, Gonadotropin & Neurosteroid Panel"
        },
        "Cortisol": {
            "description": "The stress beast affects metabolism. Optimal levels keep you calm and strong. High eats muscle; low leaves you flat. Tame it with yoga, ashwagandha, and sleep. Values provided are for an 8am sample.",
            "clinical_range": "6.2 - 19.4",
            "optimal_range": "10.0 - 16.0",
            "units": "µg/dL",
            "panel": "Hormone, Gonadotropin & Neurosteroid Panel"
        },
        "Progesterone": {
            "description": "This hormone sidekick supports T. Optimizing it aids recovery and mood. Too low, you’re tense; too high, sleepy. Balance it with lifts, eggs, and rest.",
            "clinical_range": "0.2 - 1.4",
            "optimal_range": "0.3 - 1.0",
            "units": "ng/dL",
            "panel": "Hormone, Gonadotropin & Neurosteroid Panel"
        },
        "Pregnenolone": {
            "description": "The hormone OG fuels brain and brawn. Optimal levels lift focus and stamina. Low fogs you; high’s rare but wired. Boost it with rows, healthy fats, and sleep.",
            "clinical_range": "10 - 200",
            "optimal_range": "50 - 150",
            "units": "ng/dL",
            "panel": "Hormone, Gonadotropin & Neurosteroid Panel"
        },
        "Thyroglobulin Antibody (tgAb)": {
            "description": "This thyroid rebel flags autoimmunity. Optimizing it (keeping it low) ensures smooth energy. High slows you; low’s a win. Calm it with lifts, selenium (nuts), and rest.",
            "clinical_range": "0.0 - 0.9",
            "optimal_range": "0.0 - 0.9",
            "units": "IU/mL",
            "panel": "Thyroid, Growth Factors & Glucose"
        },
        "Thyroid Peroxidase Antibody (TPOab)": {
            "description": "TPOab signals thyroid attack. Optimizing it (keeping it low) maintains vigor. High drags you; low’s steady. Chill it with training, zinc, and sleep.",
            "clinical_range": "0.0 - 34.0",
            "optimal_range": "0.0 - 9.0",
            "units": "IU/mL",
            "panel": "Thyroid, Growth Factors & Glucose"
        },
        "Reverse T3": {
            "description": "This thyroid brake can block energy. Optimizing it keeps you anabolic. High stalls gains; low’s smooth. Free it with lifts, clean eats, and rest.",
            "clinical_range": "9.2 - 24.1",
            "optimal_range": "10.0 - 18.5",
            "units": "ng/dL",
            "panel": "Thyroid, Growth Factors & Glucose"
        },
        "Lipoprotein (a)": {
            "description": "The sneaky heart risk factor. Optimizing it protects arteries and power. High tires you long-term; low’s rare. Fight it with training, niacin-rich foods, and sleep.",
            "clinical_range": "0.0 - 75",
            "optimal_range": "0.0 - 35",
            "units": "nmol/L",
            "panel": "Lipid Panel"
        },
        "Iron": {
            "description": "Iron powers oxygen flow. Optimal levels lift stamina. Low leaves you breathless; high might oxidize. Keep it steady with lifts, spinach, and rest.",
            "clinical_range": "59 - 175",
            "optimal_range": "85 - 125",
            "units": "µg/dL",
            "panel": "Iron Markers"
        },
        "Transferrin Saturation": {
            "description": "This shows iron transport efficiency. Optimizing it boosts energy delivery. Too low, you’re weak; too high, overload hits. Maintain it with lifts, vitamin C (berries), and sleep.",
            "clinical_range": "15 - 55",
            "optimal_range": "25 - 40",
            "units": "%",
            "panel": "Iron Markers"
        },
        "TIBC (Total Iron Binding Capacity)": {
            "description": "TIBC tracks iron-binding capacity. Optimal levels mean smooth transport. Off-balance, you’re tired. Optimize with training, balanced iron, and rest.",
            "clinical_range": "250 - 450",
            "optimal_range": "280 - 340",
            "units": "µg/dL",
            "panel": "Iron Markers"
        },
        "UIBC (Unsaturated Iron Binding Capacity)": {
            "description": "UIBC measures iron reserve capacity. Optimizing it steadies iron flow. Too low or high, energy wanes. Keep it steady with lifts, lean protein, and sleep.",
            "clinical_range": "112 - 347",
            "optimal_range": "160 - 280",
            "units": "µg/dL",
            "panel": "Iron Markers"
        },
        "C-Reactive Protein, High Sensitivity (hsCRP)": {
            "description": "hsCRP flags inflammation. Optimal levels mean cool vibes and heart health. High slows recovery; low’s a win. Reduce it with training, turmeric, and rest.",
            "clinical_range": "0.0 - 3.0",
            "optimal_range": "0.0 - 1.0",
            "units": "mg/L",
            "panel": "Inflammatory Marker"
        },
        "Ferritin": {
            "description": "Ferritin stores iron for energy. Optimizing it fuels lifts without rust. Too low, you’re winded; too high, inflammation creeps. Balance it with lifts, beef, and sleep.",
            "clinical_range": "12 - 300",
            "optimal_range": "50 - 150",
            "units": "ng/mL",
            "panel": "Iron Markers"
        }
    },
    "Women": {
        "Total Testosterone": {
            "description": "This hormone fuels muscle tone and energy. Optimizing it boosts strength and mood stability across cycles. Too low, you’re tired; too high, irritability hits. Keep it steady with lifts, healthy fats (avocado), and 7-9 hours of sleep.",
            "clinical_range": "4.0 - 50.0",
            "optimal_range": "25 - 75",
            "units": "ng/dL",
            "panel": "Hormone, Gonadotropin & Neurosteroid Panel"
        },
        "Free Testosterone": {
            "description": "The active T powering your gains. Optimal levels lift endurance and confidence, varying slightly by cycle. Low drags you; high might spark breakouts. Maintain it with squats, zinc (oysters), and rest.",
            "clinical_range": "0.0 - 4.2",
            "optimal_range": "2.0 - 4.2",
            "units": "ng/dL",
            "panel": "Hormone, Gonadotropin & Neurosteroid Panel"
        },
        "Estradiol": {
            "description": "The key estrogen shifts across cycle phases (follicular, ovulatory, luteal). Optimizing it enhances energy, mood, and bone health. Too low, fatigue and brittleness hit; too high, bloat weighs you down. Support it with training, phytoestrogens (soy), and sleep.",
            "clinical_range": "43.8 - 211.0",
            "optimal_range": "43.8 - 211.0",
            "units": "pg/mL",
            "panel": "Hormone, Gonadotropin & Neurosteroid Panel"
        },
        "Sex Hormone Binding Globulin (SHBG)": {
            "description": "SHBG controls T and E flow. Optimal levels sharpen hormone effects for muscle and vitality. Too high, energy dips; too low, chaos looms. Balance it with weights, magnesium (nuts), and avoiding sugar.",
            "clinical_range": "24.6 - 122.0",
            "optimal_range": "80 - 120",
            "units": "nmol/L",
            "panel": "Hormone, Gonadotropin & Neurosteroid Panel"
        },
        "Prolactin": {
            "description": "This hormone ties to vitality, peaking post-ovulation. Optimizing it lifts mood and cycle rhythm. High saps stamina; low drags subtly. Keep it in check with yoga, vitamin B6 (chicken), and rest.",
            "clinical_range": "3.6 - 25.2",
            "optimal_range": "3.6 - 10.0",
            "units": "ng/mL",
            "panel": "Hormone, Gonadotropin & Neurosteroid Panel"
        },
        "Luteinizing Hormone (LH)": {
            "description": "LH spikes mid-cycle to trigger ovulation. Optimizing it boosts fertility and energy harmony. Too low, you’re sluggish and off-cycle; too high, tension spikes. Tune it with squats, protein meals, and consistent sleep.",
            "clinical_range": "1.0 - 11.4",
            "optimal_range": "1.0 - 11.4",
            "units": "mIU/mL",
            "panel": "Hormone, Gonadotropin & Neurosteroid Panel"
        },
        "Follicle-Stimulating Hormone (FSH)": {
            "description": "FSH rises follicularly to prep eggs. Optimizing it powers vitality and cycle stability. Low stalls energy; high might signal stress. Enhance it with HIIT, omega-3s (salmon), and rest.",
            "clinical_range": "1.7 - 7.7",
            "optimal_range": "1.7 - 7.7",
            "units": "mIU/mL",
            "panel": "Hormone, Gonadotropin & Neurosteroid Panel"
        },
        "Dehydroepiandrosterone Sulfate (DHEA-S)": {
            "description": "This precursor feeds T and E production. Optimal levels lift stamina and recovery. Too low, you’re wiped; too high, restlessness hits. Boost it with deadlifts, coconut oil, and sleep.",
            "clinical_range": "41.2 -243.0",
            "optimal_range": "175 - 241.0",
            "units": "ug/dl",
            "panel": "Hormone, Gonadotropin & Neurosteroid Panel"
        },
        "Progesterone (Luteal Phase)": {
            "description": "Progesterone peaks luteally to calm cycles and mind. Optimizing it smooths periods and boosts sleep. Too low, anxiety and irregularity hit; too high, you’re drowsy. Balance it with light cardio, magnesium (spinach), and meditation. Values are for luteal phase, mid-to-high luteal range ensures ovulatory health.",
            "clinical_range": "1.8 - 23.9",
            "optimal_range": "11.0 - 23.9",
            "units": "ng/mL",
            "panel": "Hormone, Gonadotropin & Neurosteroid Panel"
        },
        "Free T3": {
            "description": "The thyroid’s active spark revs energy use. Optimal levels sharpen metabolism and power lifts. Low leaves you cold; high makes you jittery. Keep it sharp with sprints, selenium (Brazil nuts), and sleep.",
            "clinical_range": "2.0 - 4.4",
            "optimal_range": "3.2 -4.2",
            "units": "pg/mL",
            "panel": "Thyroid, Growth Factors & Glucose"
        },
        "Free T4": {
            "description": "This thyroid fuel steadies metabolism. Optimizing it sustains energy and recovery. Too low, you’re slow; too high, muscles waste. Maintain it with yoga, seafood, and rest.",
            "clinical_range": "0.82 - 1.77",
            "optimal_range": "1.0 - 1.5",
            "units": "ng/dL",
            "panel": "Thyroid, Growth Factors & Glucose"
        },
        "Insulin-Like Growth Factor I (IGF-1)": {
            "description": "IGF-1 drives muscle repair and growth. Optimal levels speed recovery and strength. Low slows gains; high might strain you. Boost it with heavy lifts, protein shakes, and sleep.",
            "clinical_range": "125 - 300",
            "optimal_range": "200 - 300",
            "units": "ng/ml",
            "panel": "Thyroid, Growth Factors & Glucose"
        },
        "HbA1c": {
            "description": "This tracks sugar control over months. Optimizing it steadies energy and cuts fat. High crashes you; low saps fuel. Stay tight with intervals, greens (broccoli), and rest.",
            "clinical_range": "4.8 - 5.6",
            "optimal_range": "4.8 - 5.2",
            "units": "%",
            "panel": "Thyroid, Growth Factors & Glucose"
        },
        "Fasting Insulin": {
            "description": "Insulin manages sugar for lean gains. Optimal levels sharpen metabolism. Too high, fat sticks; too low, you’re shaky. Keep it tight with lifts, fiber (lentils), and sleep.",
            "clinical_range": "2.6 - 24.9",
            "optimal_range": "2.6 - 10.0",
            "units": "uIU/mL",
            "panel": "Thyroid, Growth Factors & Glucose"
        },
        "Vitamin D (25-OH)": {
            "description": "The sunshine vitamin builds bones and immunity. Optimizing it lifts power and fights fatigue. Low leaves you achy; high feels off. Soak it up with sun, fatty fish (mackerel), and rest.",
            "clinical_range": "30 - 100",
            "optimal_range": "60 - 80",
            "units": "ng/mL",
            "panel": "Thyroid, Growth Factors & Glucose"
        },
        "Glutamyl Transferase (GGT)": {
            "description": "GGT detoxes the liver for a clean system. Optimal levels enhance recovery and vitality. High drags you; low’s subtle. Protect it with cardio, antioxidants (berries), and minimal booze.",
            "clinical_range": "9.0 - 48.0",
            "optimal_range": "9.0 - 25.0",
            "units": "ng/mL",
            "panel": "Thyroid, Growth Factors & Glucose"
        },
        "Glucose": {
            "description": "Blood sugar fuels your grind. Optimizing it sustains energy without dips. Too low, you’re woozy; too high, sluggishness hits. Steady it with cardio, balanced carbs (quinoa), and sleep.",
            "clinical_range": "70-99",
            "optimal_range": "70-85",
            "units": "mg/dL",
            "panel": "Thyroid, Growth Factors & Glucose"
        },
        "Calcium": {
            "description": "This mineral keeps bones tough and nerves sharp. Optimal levels mean solid lifts. Low cramps you; high might stiffen. Stack it with weights, dairy (yogurt), and rest.",
            "clinical_range": "8.5 - 10.5",
            "optimal_range": "8.5 - 10.5",
            "units": "mg/dL",
            "panel": "Metabolic Panel"
        },
        "Sodium": {
            "description": "Sodium powers hydration and muscle fullness. Optimizing it boosts endurance. Too low, cramps hit; too high, bloat slows. Balance it with lifts, electrolyte drinks, and hydration.",
            "clinical_range": "135 - 145",
            "optimal_range": "135 - 145",
            "units": "mmol/L",
            "panel": "Metabolic Panel"
        },
        "Potassium": {
            "description": "Potassium drives muscle and heart rhythm. Optimal levels mean strong lifts. Low tires you; high throws you off. Load it with sprints, bananas, and sleep.",
            "clinical_range": "3.5 - 5.0",
            "optimal_range": "3.5 - 5.0",
            "units": "mmol/L",
            "panel": "Metabolic Panel"
        },
        "Chloride": {
            "description": "Chloride balances pH for stamina. Optimizing it keeps recovery tight. Too low or high, you’re weak. Steady it with training, broth, and rest.",
            "clinical_range": "98 - 107",
            "optimal_range": "98 - 107",
            "units": "mmol/L",
            "panel": "Metabolic Panel"
        },
        "Carbon Dioxide (CO₂), Total": {
            "description": "CO₂ reflects acid-base balance. Optimal levels sustain breathing and endurance. Off-kilter, you’re foggy. Maintain it with deep breathing, hydration, and sleep.",
            "clinical_range": "22 - 29",
            "optimal_range": "22 - 29",
            "units": "mmol/L",
            "panel": "Metabolic Panel"
        },
        "Blood Urea Nitrogen (BUN)": {
            "description": "BUN gauges kidney cleanup. Optimizing it ensures a lean system. High wears you out; low might mean underfueling. Stay optimal with lifts, water, and rest.",
            "clinical_range": "7.0 - 20.0",
            "optimal_range": "7.0 - 20.0",
            "units": "mg/dL",
            "panel": "Metabolic Panel"
        },
        "Creatinine": {
            "description": "This tracks muscle waste and kidney health. Optimal levels support gains. High feels heavy; low’s rare. Keep it steady with training, hydration, and sleep.",
            "clinical_range": "0.6 - 1.3",
            "optimal_range": "0.6 - 1.3",
            "units": "mg/dL",
            "panel": "Metabolic Panel"
        },
        "BUN/Creatinine Ratio": {
            "description": "This ratio fine-tunes kidney function. Optimizing it keeps waste clearance sharp. Off-balance, you’re sluggish. Balance it with lifts, balanced protein, and rest.",
            "clinical_range": "10.0 - 20.0",
            "optimal_range": "10.0 - 20.0",
            "units": ":1 Ratio",
            "panel": "Metabolic Panel"
        },
        "Total Protein": {
            "description": "Total protein fuels repair and power. Optimal levels speed recovery. Too low, you’re frail; too high, strain hits. Boost it with weights, eggs, and sleep.",
            "clinical_range": "6.0 - 8.3",
            "optimal_range": "6.0 - 8.3",
            "units": "g/dL",
            "panel": "Metabolic Panel"
        },
        "Albumin": {
            "description": "Albumin balances blood fluids. Optimizing it prevents swelling and boosts endurance. Low leaks energy; high’s rare. Keep it up with lifts, whey, and rest.",
            "clinical_range": "3.5 - 5.0",
            "optimal_range": "3.5 -5.0",
            "units": "g/dL",
            "panel": "Metabolic Panel"
        },
        "Globulin, Total": {
            "description": "Globulins bolster immunity. Optimal levels fight bugs and keep you strong. Too low, you’re sick-prone; too high, inflammation flares. Support it with training, broth, and sleep.",
            "clinical_range": "2.0 -3.5",
            "optimal_range": "2.0 - 3.5",
            "units": "g/dL",
            "panel": "Metabolic Panel"
        },
        "Albumin/Globulin (A/G) Ratio": {
            "description": "This protein balance aids recovery. Optimizing it enhances repair. Off-kilter, you’re slow to rebound. Maintain it with lifts, balanced protein, and rest.",
            "clinical_range": "1.0 - 2.5",
            "optimal_range": "1.0 - 2.5",
            "units": "Ratio",
            "panel": "Metabolic Panel"
        },
        "Total Bilirubin": {
            "description": "Bilirubin checks liver cleanup. Optimal levels mean steady energy. High drains you; low’s subtle. Keep it clean with cardio, greens, and sleep.",
            "clinical_range": "0.1 - 1.2",
            "optimal_range": "0.1 - 1.2",
            "units": "mg/dL",
            "panel": "Metabolic Panel"
        },
        "Alkaline Phosphatase": {
            "description": "This enzyme tracks bone and liver health. Optimizing it strengthens frames. Too low, bones weaken; too high, fatigue hits. Stay optimal with weights, kale, and rest.",
            "clinical_range": "44 - 147",
            "optimal_range": "44 - 147",
            "units": "IU/L",
            "panel": "Metabolic Panel"
        },
        "Aspartate Aminotransferase (AST)": {
            "description": "AST monitors liver and muscle. Optimal levels mean clean function. High tires you; low’s fine. Protect it with training, turmeric, and sleep.",
            "clinical_range": "10.0 - 40.0",
            "optimal_range": "10.0 - 25.0",
            "units": "IU/L",
            "panel": "Metabolic Panel"
        },
        "Alanine Aminotransferase (ALT)": {
            "description": "ALT zeroes in on liver health. Optimizing it keeps detox smooth. High slows you; low’s no issue. Maintain it with lifts, Brussels sprouts, and rest.",
            "clinical_range": "7.0 - 56.0",
            "optimal_range": "7.0 - 26.0",
            "units": "IU/L",
            "panel": "Metabolic Panel"
        },
        "Estimated Glomerular Filtration Rate (eGFR)": {
            "description": "eGFR measures kidney filtration. Optimal levels clear waste for gains. Low drags you; high’s not a worry. Keep it flowing with training, water, and sleep.",
            "clinical_range": "60 - 150",
            "optimal_range": "80 - 140",
            "units": "mL/min/1.73 m²",
            "panel": "Metabolic Panel"
        },
        "White Blood Cell (WBC) Count": {
            "description": "WBCs fight infections. Optimizing them keeps you tough. Too low, bugs win; too high, inflammation flares. Boost it with lifts, zinc seeds, and rest.",
            "clinical_range": "4500 - 11000",
            "optimal_range": "4500 - 11000",
            "units": "cells/µL",
            "panel": "CBC w/ Differential and Platelet"
        },
        "Red Blood Cell (RBC) Count": {
            "description": "RBCs haul oxygen for endurance. Optimal levels power sets. Low leaves you winded; high thickens blood. Support it with training, spinach, and sleep.",
            "clinical_range": "3.77 - 5.28",
            "optimal_range": "4.8 - 5.1",
            "units": "million cells/µL",
            "panel": "CBC w/ Differential and Platelet"
        },
        "Hemoglobin (Hgb)": {
            "description": "Hemoglobin carries O₂ for stamina. Optimizing it lifts energy. Too low, you’re weak; too high, sluggishness hits. Keep it strong with lifts, beef, and rest.",
            "clinical_range": "11.1 - 15.9",
            "optimal_range": "11.1 - 15.9",
            "units": "g/dL",
            "panel": "CBC w/ Differential and Platelet"
        },
        "Hematocrit (Hct)": {
            "description": "Hematocrit measures blood thickness. Optimal levels mean pump perfection. Low saps stamina; high feels heavy. Balance it with training, hydration, and sleep.",
            "clinical_range": "34.0 - 46.6",
            "optimal_range": "34.0 - 46.6",
            "units": "%",
            "panel": "CBC w/ Differential and Platelet"
        },
        "Mean Corpuscular Volume (MCV)": {
            "description": "MCV sizes red blood cells. Optimizing it ensures O₂ flow. Off-balance, you’re tired. Maintain it with lifts, B12 fish, and rest.",
            "clinical_range": "79 - 97",
            "optimal_range": "79 - 97",
            "units": "fL",
            "panel": "CBC w/ Differential and Platelet"
        },
        "Mean Corpuscular Hemoglobin (MCH)": {
            "description": "MCH tracks hemoglobin per cell. Optimal levels fuel power. Low weakens you; high’s rare. Boost it with training, liver, and sleep.",
            "clinical_range": "26.6 - 33.0",
            "optimal_range": "26.6 - 33.0",
            "units": "pg",
            "panel": "CBC w/ Differential and Platelet"
        },
        "Mean Corpuscular Hemoglobin Concentration (MCHC)": {
            "description": "MCHC measures hemoglobin density. Optimizing it keeps blood strong. Off-kilter, you’re dragging. Keep it steady with lifts, vitamin C (oranges), and rest.",
            "clinical_range": "32 - 36",
            "optimal_range": "32 - 36",
            "units": "%",
            "panel": "CBC w/ Differential and Platelet"
        },
        "Red Cell Distribution Width (RDW)": {
            "description": "RDW checks RBC variety. Optimal levels mean consistent energy. High tires you; low’s steady. Optimize with training, folate beans, and sleep.",
            "clinical_range": "11.0 - 15.0",
            "optimal_range": "11.0 - 15.0",
            "units": "%",
            "panel": "CBC w/ Differential and Platelet"
        },
        "Platelet Count": {
            "description": "Platelets aid clotting and recovery. Optimizing them speeds healing. Too low, you bruise; too high, clotting risks rise. Support it with lifts, kale, and rest.",
            "clinical_range": "150000 - 400000",
            "optimal_range": "150000 - 375000",
            "units": "cells/µL",
            "panel": "CBC w/ Differential and Platelet"
        },
        "Mean Platelet Volume (MPV)": {
            "description": "MPV sizes platelets for balance. Optimal levels keep recovery smooth. Off-kilter, inflammation hits. Maintain it with training, omega-3s (flax), and sleep.",
            "clinical_range": "7.0 - 9.0",
            "optimal_range": "7.0 - 9.0",
            "units": "fL",
            "panel": "CBC w/ Differential and Platelet"
        },
        "Neutrophils": {
            "description": "Neutrophils battle germs. Optimizing them keeps you tough. Too low, infections strike; too high, stress flares. Boost it with lifts, zinc (pumpkin seeds), and rest.",
            "clinical_range": "50 - 70",
            "optimal_range": "50 - 70",
            "units": "%",
            "panel": "CBC w/ Differential and Platelet"
        },
        "Lymphocytes": {
            "description": "Lymphocytes defend immunity. Optimal levels mean resilience. Low leaves you sick; high signals strain. Support it with training, vitamin C (peppers), and sleep.",
            "clinical_range": "18 - 42",
            "optimal_range": "18 - 42",
            "units": "%",
            "panel": "CBC w/ Differential and Platelet"
        },
        "Monocytes": {
            "description": "Monocytes clean infections. Optimizing them keeps you strong. Too low, bugs linger; too high, inflammation spikes. Keep it steady with lifts, blueberries, and rest.",
            "clinical_range": "3.5 - 9.0",
            "optimal_range": "3.5 - 9.0",
            "units": "%",
            "panel": "CBC w/ Differential and Platelet"
        },
        "Eosinophils": {
            "description": "Eosinophils tackle allergies. Optimal levels mean calm vibes. High brings sniffles; low’s fine. Maintain it with training, clean eats, and sleep.",
            "clinical_range": "1.0 - 3.0",
            "optimal_range": "1.0 - 2.6",
            "units": "%",
            "panel": "CBC w/ Differential and Platelet"
        },
        "Basophils": {
            "description": "Basophils handle rare immune tasks. Optimizing them keeps balance. High signals inflammation; low’s fine. Steady it with lifts, lean protein, and rest.",
            "clinical_range": "0.0 - 2.0",
            "optimal_range": "0.0 - 2.0",
            "units": "%",
            "panel": "CBC w/ Differential and Platelet"
        },
        "Total Cholesterol": {
            "description": "This fat fuels hormones and heart health. Optimal levels boost energy. Too low, you’re flat; too high, pipes clog. Optimize with training, nuts, and sleep.",
            "clinical_range": "100 - 199",
            "optimal_range": "100 - 170",
            "units": "mg/dL",
            "panel": "Lipid Panel"
        },
        "HDL": {
            "description": "HDL clears junk as ‘good’ cholesterol. Optimizing it sharpens stamina. Low drags you; high’s a win. Boost it with cardio, olive oil, and rest.",
            "clinical_range": "50 - 150",
            "optimal_range": "60 - 150",
            "units": "mg/dL",
            "panel": "Lipid Panel"
        },
        "LDL (calculated)": {
            "description": "LDL, the ‘bad’ cholesterol, can clog pipes. Optimal levels keep energy up. High slows you; low’s rare. Keep it low with lifts, oats, and sleep.",
            "clinical_range": "0 - 129",
            "optimal_range": "0 - 99",
            "units": "mg/dL",
            "panel": "Lipid Panel"
        },
        "Triglycerides": {
            "description": "Triglycerides store energy. Optimizing them keeps you lean. High piles fat; low saps fuel. Maintain it with training, fish oil, and rest.",
            "clinical_range": "0 - 149",
            "optimal_range": "0 - 100",
            "units": "mg/dL",
            "panel": "Lipid Panel"
        },
        "VLDL (calculated)": {
            "description": "VLDL hauls triglycerides. Optimal levels mean clean blood. High bogs you; low’s fine. Keep it steady with lifts, lean meats, and sleep.",
            "clinical_range": "5.0 - 40.0",
            "optimal_range": "5.0 - 15.0",
            "units": "mg/dL",
            "panel": "Lipid Panel"
        },
        "Total Cholesterol/HDL Ratio": {
            "description": "This ratio gauges heart risk. Optimizing it lifts vigor. High tires you; low’s a champ. Balance it with cardio, chia, and rest.",
            "clinical_range": "0.0 - 4.4",
            "optimal_range": "0.0 - 3.0",
            "units": "ratio",
            "panel": "Lipid Panel"
        },
        "LDL/HDL Ratio": {
            "description": "This cholesterol showdown affects arteries. Optimal levels mean strength. High slows you; low’s smooth. Optimize with training, nuts, and sleep.",
            "clinical_range": "0.0 - 3.2",
            "optimal_range": "0.0 - 1.8",
            "units": "ratio",
            "panel": "Lipid Panel"
        },
        "Estradiol, Sensitive / Ultrasensitive (LC/MS)": {
            "description": "This precise test tracks E shifts by cycle phase (e.g., luteal highs). Optimizing it steadies mood and bones. Too high, bloat hits; too low, energy tanks. Ranges are for Luteal phase, Follicular clinical standard is 12 - 233 and ovulatory is 41 - 398. Dial it with lifts, flaxseeds, and rest.",
            "clinical_range": "15.0 - 350.0",
            "optimal_range": "100 - 250",
            "units": "pg/mL",
            "panel": "Hormone, Gonadotropin & Neurosteroid Panel"
        },
        "Cortisol": {
            "description": "The stress beast affects metabolism. Optimal levels keep you calm and strong. High eats muscle; low leaves you flat. Tame it with yoga, ashwagandha, and sleep. Values provided are for an 8am sample.",
            "clinical_range": "6.2 - 19.4",
            "optimal_range": "10.0 - 15.0",
            "units": "µg/dL",
            "panel": "Hormone, Gonadotropin & Neurosteroid Panel"
        },
        "ApoB": {
            "description": "ApoB counts risky particles. Optimizing it cuts heart risk and boosts endurance. High drags stamina; low’s a win. Stay optimal with cardio, avocado, and rest.",
            "clinical_range": "40.0 - 125.0",
            "optimal_range": "50.0 - 70.0",
            "units": "mg/dL",
            "panel": "Lipid Panel"
        },
        "Lipoprotein (a)": {
            "description": "The sneaky heart risk factor. Optimizing it protects arteries and power. High tires you long-term; low’s rare. Fight it with training, niacin-rich foods, and sleep.",
            "clinical_range": "0.0 - 75.0",
            "optimal_range": "0.0 - 30.0",
            "units": "nmol/L",
            "panel": "Lipid Panel"
        },
        "Ferritin": {
            "description": "Ferritin stores iron for energy. Optimizing it fuels lifts without rust. Too low, you’re winded; too high, inflammation creeps. Balance it with lifts, beef, and sleep.",
            "clinical_range": "15.0 - 150",
            "optimal_range": "40.0 - 100",
            "units": "ng/mL",
            "panel": "Iron Markers"
        },
        "Iron": {
            "description": "Iron powers oxygen flow. Optimal levels lift stamina. Low leaves you breathless; high might oxidize. Keep it steady with lifts, spinach, and rest.",
            "clinical_range": "27.0 - 159.0",
            "optimal_range": "60.0 - 100.0",
            "units": "µg/dL",
            "panel": "Iron Markers"
        },
        "Transferrin Saturation": {
            "description": "This shows iron transport efficiency. Optimizing it boosts energy delivery. Too low, you’re weak; too high, overload hits. Maintain it with lifts, vitamin C (berries), and sleep.",
            "clinical_range": "15.0 - 55",
            "optimal_range": "25.0 - 35.0",
            "units": "%",
            "panel": "Iron Markers"
        },
        "TIBC (Total Iron Binding Capacity)": {
            "description": "TIBC tracks iron-binding capacity. Optimal levels mean smooth transport. Off-balance, you’re tired. Optimize with training, balanced iron, and rest.",
            "clinical_range": "250 - 450",
            "optimal_range": "280 - 340",
            "units": "µg/dL",
            "panel": "Iron Markers"
        },
        "UIBC (Unsaturated Iron Binding Capacity)": {
            "description": "UIBC measures iron reserve capacity. Optimizing it steadies iron flow. Too low or high, energy wanes. Keep it steady with lifts, lean protein, and sleep.",
            "clinical_range": "112 - 347",
            "optimal_range": "180 - 240",
            "units": "µg/dL",
            "panel": "Iron Markers"
        },
        "C-Reactive Protein, High Sensitivity (hsCRP)": {
            "description": "hsCRP flags inflammation. Optimal levels mean cool vibes and heart health. High slows recovery; low’s a win. Reduce it with training, turmeric, and rest.",
            "clinical_range": "0.0 - 3.0",
            "optimal_range": "0.0 - 1.0",
            "units": "mg/L",
            "panel": "Inflammatory Marker"
        }
    },
    "Post Menopausal Women": {
        "Total Testosterone": {
            "description": "This hormone keeps muscles humming and energy up. Optimizing it boosts strength and fights fatigue. Too low, you’re dragging; too high, irritability hits. Stay optimal with lifts, healthy fats (avocado), and 7-9 hours of sleep.",
            "clinical_range": "4.0 - 50",
            "optimal_range": "15.0 - 40.0",
            "units": "ng/dL",
            "panel": "Hormone, Gonadotropin & Neurosteroid Panel"
        },
        "Free Testosterone": {
            "description": "The unbound T fueling your grit. Optimal levels sharpen power and recovery. Low leaves you flat; high might spark skin woes. Keep it steady with squats, zinc (oysters), and rest.",
            "clinical_range": "0.2 - 4.2",
            "optimal_range": "1.0 - 3.0",
            "units": "ng/dL",
            "panel": "Hormone, Gonadotropin & Neurosteroid Panel"
        },
        "Estradiol": {
            "description": "This estrogen supports brain and bone strength post-menopause. Optimizing it enhances memory and joints. Too low, fog and brittleness hit; too high, bloat creeps in. Maintain it with weights, phytoestrogens (soy), and sleep.",
            "clinical_range": "0.0 - 30.0",
            "optimal_range": "10.0 - 30.0",
            "units": "pg/mL",
            "panel": "Hormone, Gonadotropin & Neurosteroid Panel"
        },
        "SHBG": {
            "description": "SHBG controls T and E flow. Optimal levels balance hormones for vitality. Too high, you’re sluggish; too low, chaos looms. Balance it with strength training, magnesium (nuts), and avoiding sugar.",
            "clinical_range": "24.6 - 122.0",
            "optimal_range": "70.0 - 110.0",
            "units": "nmol/L",
            "panel": "Hormone, Gonadotropin & Neurosteroid Panel"
        },
        "Prolactin": {
            "description": "This hormone ties to vitality. Optimizing it keeps mood bright and energy steady. High saps stamina; low drags subtly. Stay in check with yoga, vitamin B6 (chicken), and rest.",
            "clinical_range": "3.6 - 25.2",
            "optimal_range": "3.6 - 15",
            "units": "ng/mL",
            "panel": "Hormone, Gonadotropin & Neurosteroid Panel"
        },
        "Luteinizing Hormone (LH)": {
            "description": "LH signals hormone production, elevated post-menopause. Optimal levels lift energy harmony. Too low, you’re off; too high, tension spikes. Tune it with lifts, protein meals, and sleep.",
            "clinical_range": "15 - 65",
            "optimal_range": "15 - 65",
            "units": "mIU/mL",
            "panel": "Hormone, Gonadotropin & Neurosteroid Panel"
        },
        "Follicle-Stimulating Hormone (FSH)": {
            "description": "FSH rises post-menopause as ovaries retire. Optimizing it supports vigor despite the shift. Too low, energy dips; too high feels wired. Enhance it with HIIT, omega-3s (salmon), and rest.",
            "clinical_range": "25 - 135",
            "optimal_range": "25 - 135",
            "units": "mIU/mL",
            "panel": "Hormone, Gonadotropin & Neurosteroid Panel"
        },
        "DHEA-S": {
            "description": "This adrenal hormone feeds T and E, key for energy post-menopause. Optimal levels boost stamina and focus. Too low, you’re wiped; too high, restlessness hits. Boost it with deadlifts, coconut oil, and sleep.",
            "clinical_range": "41.2 - 243.0",
            "optimal_range": "50.0 - 150.0",
            "units": "ug/dL",
            "panel": "Hormone, Gonadotropin & Neurosteroid Panel"
        },
        "Progesterone": {
            "description": "This calming hormone aids nerves post-menopause. Optimizing it boosts sleep and repair. Too low, anxiety hits; too high, you’re drowsy. Balance it with light cardio, magnesium (spinach), and meditation.",
            "clinical_range": "0.1 - 1.0",
            "optimal_range": "0.1 - 1.0",
            "units": "ng/mL",
            "panel": "Hormone, Gonadotropin & Neurosteroid Panel"
        },
        "Free T3": {
            "description": "The thyroid’s active spark revs energy use. Optimal levels sharpen metabolism and power lifts. Low leaves you cold; high makes you jittery. Keep it sharp with sprints, selenium (Brazil nuts), and sleep.",
            "clinical_range": "2.0 - 4.4",
            "optimal_range": "3.2 - 4.2",
            "units": "pg/mL",
            "panel": "Thyroid, Growth Factors & Glucose"
        },
        "Free T4": {
            "description": "This thyroid fuel steadies metabolism. Optimizing it sustains energy and recovery. Too low, you’re slow; too high, muscles waste. Maintain it with yoga, seafood, and rest.",
            "clinical_range": "0.82 - 1.77",
            "optimal_range": "0.82 - 1.77",
            "units": "ng/dL",
            "panel": "Thyroid, Growth Factors & Glucose"
        },
        "IGF-1": {
            "description": "IGF-1 drives muscle repair and growth. Optimal levels speed recovery and strength. Low slows gains; high might strain you. Boost it with heavy lifts, protein shakes, and sleep.",
            "clinical_range": "125 - 300",
            "optimal_range": "100 - 200",
            "units": "ng/mL",
            "panel": "Thyroid, Growth Factors & Glucose"
        },
        "HbA1c": {
            "description": "This tracks sugar control over months. Optimizing it steadies energy and cuts fat. High crashes you; low saps fuel. Stay tight with intervals, greens (broccoli), and rest.",
            "clinical_range": "4.8 - 5.6",
            "optimal_range": "4.8 - 5.3",
            "units": "%",
            "panel": "Thyroid, Growth Factors & Glucose"
        },
        "Fasting Insulin": {
            "description": "Insulin manages sugar for lean gains. Optimal levels sharpen metabolism. Too high, fat sticks; too low, you’re shaky. Keep it tight with lifts, fiber (lentils), and sleep.",
            "clinical_range": "2.6 - 24.9",
            "optimal_range": "2.6 - 8.0",
            "units": "uIU/mL",
            "panel": "Thyroid, Growth Factors & Glucose"
        },
        "Vitamin D (25-OH)": {
            "description": "The sunshine vitamin fortifies bones and immunity. Optimizing it lifts power and fights fatigue. Low leaves you achy; high feels off. Soak it up with sun, fatty fish (mackerel), and rest.",
            "clinical_range": "30 - 100",
            "optimal_range": "60 - 80",
            "units": "ng/mL",
            "panel": "Thyroid, Growth Factors & Glucose"
        },
        "Glutamyl Transferase (GGT)": {
            "description": "GGT detoxes the liver for a clean system. Optimal levels enhance recovery and vitality. High drags you; low’s subtle. Protect it with cardio, antioxidants (berries), and minimal booze.",
            "clinical_range": "9.0 - 48.0",
            "optimal_range": "9.0 - 20.0",
            "units": "U/L",
            "panel": "Thyroid, Growth Factors & Glucose"
        },
        "Glucose": {
            "description": "Blood sugar fuels your grind. Optimizing it sustains energy without dips. Too low, you’re woozy; too high, sluggishness hits. Steady it with cardio, balanced carbs (quinoa), and sleep.",
            "clinical_range": "70 - 99",
            "optimal_range": "70 - 85",
            "units": "mg/dL",
            "panel": "Thyroid, Growth Factors & Glucose"
        },
        "Calcium": {
            "description": "This mineral keeps bones tough and nerves sharp. Optimal levels mean solid lifts. Low cramps you; high might stiffen. Stack it with weights, dairy (yogurt), and rest.",
            "clinical_range": "8.5 - 10.5",
            "optimal_range": "8.5 - 10.5",
            "units": "mg/dL",
            "panel": "Metabolic Panel"
        },
        "Sodium": {
            "description": "Sodium powers hydration and muscle fullness. Optimizing it boosts endurance. Too low, cramps hit; too high, bloat slows. Balance it with lifts, electrolyte drinks, and hydration.",
            "clinical_range": "135.0 - 145.0",
            "optimal_range": "135.0 - 145.0",
            "units": "mmol/L",
            "panel": "Metabolic Panel"
        },
        "Potassium": {
            "description": "Potassium drives muscle and heart rhythm. Optimal levels mean strong lifts. Low tires you; high throws you off. Load it with sprints, bananas, and sleep.",
            "clinical_range": "3.5 - 5.0",
            "optimal_range": "3.5 - 5.0",
            "units": "mmol/L",
            "panel": "Metabolic Panel"
        },
        "Chloride": {
            "description": "Chloride balances pH for stamina. Optimizing it keeps recovery tight. Too low or high, you’re weak. Steady it with training, broth, and rest.",
            "clinical_range": "98.0 - 107.0",
            "optimal_range": "98.0 - 107.0",
            "units": "mmol/L",
            "panel": "Metabolic Panel"
        },
        "Carbon Dioxide (CO₂), Total": {
            "description": "CO₂ reflects acid-base balance. Optimal levels sustain breathing and endurance. Off-kilter, you’re foggy. Maintain it with deep breathing, hydration, and sleep.",
            "clinical_range": "22.0 - 29.0",
            "optimal_range": "22.0 - 29.0",
            "units": "mmol/L",
            "panel": "Metabolic Panel"
        },
        "Blood Urea Nitrogen (BUN)": {
            "description": "BUN gauges kidney cleanup. Optimizing it ensures a lean system. High wears you out; low might mean underfueling. Stay optimal with lifts, water, and rest.",
            "clinical_range": "7.0 - 20.0",
            "optimal_range": "7.0 - 20.0",
            "units": "mg/dL",
            "panel": "Metabolic Panel"
        },
        "Creatinine": {
            "description": "This tracks muscle waste and kidney health. Optimal levels support gains. High feels heavy; low’s rare. Keep it steady with training, hydration, and sleep.",
            "clinical_range": "0.6 - 1.3",
            "optimal_range": "0.6 - 1.3",
            "units": "mg/dL",
            "panel": "Metabolic Panel"
        },
        "BUN/Creatinine Ratio": {
            "description": "This ratio fine-tunes kidney function. Optimizing it keeps waste clearance sharp. Off-balance, you’re sluggish. Balance it with lifts, balanced protein, and rest.",
            "clinical_range": "10.0 - 20.0",
            "optimal_range": "10.0 - 20.0",
            "units": ":1 Ratio",
            "panel": "Metabolic Panel"
        },
        "Total Protein": {
            "description": "Total protein fuels repair and power. Optimal levels speed recovery. Too low, you’re frail; too high, strain hits. Boost it with weights, eggs, and sleep.",
            "clinical_range": "6.0 - 8.3",
            "optimal_range": "6.0 - 8.3",
            "units": "g/dL",
            "panel": "Metabolic Panel"
        },
        "Albumin": {
            "description": "Albumin balances blood fluids. Optimizing it prevents swelling and boosts endurance. Low leaks energy; high’s rare. Keep it up with lifts, whey, and rest.",
            "clinical_range": "3.5 - 5.0",
            "optimal_range": "3.5 - 5.0",
            "units": "g/dL",
            "panel": "Metabolic Panel"
        },
        "Globulin, Total": {
            "description": "Globulins bolster immunity. Optimal levels fight bugs and keep you strong. Too low, you’re sick-prone; too high, inflammation flares. Support it with training, broth, and sleep.",
            "clinical_range": "2.0 - 3.5",
            "optimal_range": "2.0 - 3.5",
            "units": "g/dL",
            "panel": "Metabolic Panel"
        },
        "Albumin/Globulin (A/G) Ratio": {
            "description": "This protein balance aids recovery. Optimizing it enhances repair. Off-kilter, you’re slow to rebound. Maintain it with lifts, balanced protein, and rest.",
            "clinical_range": "1.0 - 2.5",
            "optimal_range": "1.0 - 2.5",
            "units": "ratio",
            "panel": "Metabolic Panel"
        },
        "Total Bilirubin": {
            "description": "Bilirubin checks liver cleanup. Optimal levels mean steady energy. High drains you; low’s subtle. Keep it clean with cardio, greens, and sleep.",
            "clinical_range": "0.1 - 1.2",
            "optimal_range": "0.1 - 1.2",
            "units": "mg/dL",
            "panel": "Metabolic Panel"
        },
        "Alkaline Phosphatase": {
            "description": "This enzyme tracks bone and liver health. Optimizing it strengthens frames. Too low, bones weaken; too high, fatigue hits. Stay optimal with weights, kale, and rest.",
            "clinical_range": "44.0 - 147.0",
            "optimal_range": "44.0 - 147.0",
            "units": "IU/L",
            "panel": "Metabolic Panel"
        },
        "Aspartate Aminotransferase (AST)": {
            "description": "AST monitors liver and muscle. Optimal levels mean clean function. High tires you; low’s fine. Protect it with training, turmeric, and sleep.",
            "clinical_range": "10.0 - 40.0",
            "optimal_range": "10.0 -25.0",
            "units": "IU/L",
            "panel": "Metabolic Panel"
        },
        "Alanine Aminotransferase (ALT)": {
            "description": "ALT zeroes in on liver health. Optimizing it keeps detox smooth. High slows you; low’s no issue. Maintain it with lifts, Brussels sprouts, and rest.",
            "clinical_range": "7.0 - 56.0",
            "optimal_range": "7.0 - 26.0",
            "units": "IU/L",
            "panel": "Metabolic Panel"
        },
        "Estimated Glomerular Filtration Rate (eGFR)": {
            "description": "eGFR measures kidney filtration. Optimal levels clear waste for gains. Low drags you; high’s not a worry. Keep it flowing with training, water, and sleep.",
            "clinical_range": "60 - 150",
            "optimal_range": "75 - 140",
            "units": "mL/min/1.73 m²",
            "panel": "Metabolic Panel"
        },
        "White Blood Cell (WBC) Count": {
            "description": "WBCs fight infections. Optimizing them keeps you tough. Too low, bugs win; too high, inflammation flares. Boost it with lifts, zinc seeds, and rest.",
            "clinical_range": "4500 - 11000",
            "optimal_range": "4500 - 11000",
            "units": "cells/µL",
            "panel": "CBC w/ Differential and Platelet"
        },
        "Red Blood Cell (RBC) Count": {
            "description": "RBCs haul oxygen for endurance. Optimal levels power sets. Low leaves you winded; high thickens blood. Support it with training, spinach, and sleep.",
            "clinical_range": "3.77 - 5.28",
            "optimal_range": "4.80 - 5.10",
            "units": "million cells/µL",
            "panel": "CBC w/ Differential and Platelet"
        },
        "Hemoglobin (Hgb)": {
            "description": "Hemoglobin carries O₂ for stamina. Optimizing it lifts energy. Too low, you’re weak; too high, sluggishness hits. Keep it strong with lifts, beef, and rest.",
            "clinical_range": "11.1 - 15.9",
            "optimal_range": "11.1 - 15.9",
            "units": "g/dL",
            "panel": "CBC w/ Differential and Platelet"
        },
        "Hematocrit (Hct)": {
            "description": "Hematocrit measures blood thickness. Optimal levels mean pump perfection. Low saps stamina; high feels heavy. Balance it with training, hydration, and sleep.",
            "clinical_range": "34.0 - 46.6",
            "optimal_range": "34.0 - 46.6",
            "units": "%",
            "panel": "CBC w/ Differential and Platelet"
        },
        "Mean Corpuscular Volume (MCV)": {
            "description": "MCV sizes red blood cells. Optimizing it ensures O₂ flow. Off-balance, you’re tired. Maintain it with lifts, B12 fish, and rest.",
            "clinical_range": "79 - 97",
            "optimal_range": "79 - 97",
            "units": "fL",
            "panel": "CBC w/ Differential and Platelet"
        },
        "Mean Corpuscular Hemoglobin (MCH)": {
            "description": "MCH tracks hemoglobin per cell. Optimal levels fuel power. Low weakens you; high’s rare. Boost it with training, liver, and sleep.",
            "clinical_range": "26.6 - 33.0",
            "optimal_range": "26.6 - 33.0",
            "units": "pg",
            "panel": "CBC w/ Differential and Platelet"
        },
        "Mean Corpuscular Hemoglobin Concentration (MCHC)": {
            "description": "MCHC measures hemoglobin density. Optimizing it keeps blood strong. Off-kilter, you’re dragging. Keep it steady with lifts, vitamin C (oranges), and rest.",
            "clinical_range": "32 - 36",
            "optimal_range": "32 - 36",
            "units": "%",
            "panel": "CBC w/ Differential and Platelet"
        },
        "Red Cell Distribution Width (RDW)": {
            "description": "RDW checks RBC variety. Optimal levels mean consistent energy. High tires you; low’s steady. Optimize with training, folate beans, and sleep.",
            "clinical_range": "11.0 - 15.0",
            "optimal_range": "11.0 - 15.0",
            "units": "%",
            "panel": "CBC w/ Differential and Platelet"
        },
        "Platelet Count": {
            "description": "Platelets aid clotting and recovery. Optimizing them speeds healing. Too low, you bruise; too high, clotting risks rise. Support it with lifts, kale, and rest.",
            "clinical_range": "150000 - 400000",
            "optimal_range": "180000 - 350000",
            "units": "cells/µL",
            "panel": "CBC w/ Differential and Platelet"
        },
        "Mean Platelet Volume (MPV)": {
            "description": "MPV sizes platelets for balance. Optimal levels keep recovery smooth. Off-kilter, inflammation hits. Maintain it with training, omega-3s (flax), and sleep.",
            "clinical_range": "7.0 to 9.0",
            "optimal_range": "7.0 to 9.0",
            "units": "fL",
            "panel": "CBC w/ Differential and Platelet"
        },
        "Neutrophils": {
            "description": "Neutrophils battle germs. Optimizing them keeps you tough. Too low, infections strike; too high, stress flares. Boost it with lifts, zinc (pumpkin seeds), and rest.",
            "clinical_range": "50 - 70",
            "optimal_range": "50 - 70",
            "units": "%",
            "panel": "CBC w/ Differential and Platelet"
        },
        "Lymphocytes": {
            "description": "Lymphocytes defend immunity. Optimal levels mean resilience. Low leaves you sick; high signals strain. Support it with training, vitamin C (peppers), and sleep.",
            "clinical_range": "18 - 42",
            "optimal_range": "18 - 42",
            "units": "%",
            "panel": "CBC w/ Differential and Platelet"
        },
        "Monocytes": {
            "description": "Monocytes clean infections. Optimizing them keeps you strong. Too low, bugs linger; too high, inflammation spikes. Keep it steady with lifts, blueberries, and rest.",
            "clinical_range": "3.5 - 9.0",
            "optimal_range": "3.5 - 9.0",
            "units": "%",
            "panel": "CBC w/ Differential and Platelet"
        },
        "Eosinophils": {
            "description": "Eosinophils tackle allergies. Optimal levels mean calm vibes. High brings sniffles; low’s fine. Maintain it with training, clean eats, and sleep.",
            "clinical_range": "1.0 - 3.0",
            "optimal_range": "1.0 - 2.6",
            "units": "%",
            "panel": "CBC w/ Differential and Platelet"
        },
        "Basophils": {
            "description": "Basophils handle rare immune tasks. Optimizing them keeps balance. High signals inflammation; low’s fine. Steady it with lifts, lean protein, and rest.",
            "clinical_range": "0.0 - 2.0",
            "optimal_range": "0.0 - 2.0",
            "units": "%",
            "panel": "CBC w/ Differential and Platelet"
        },
        "Total Cholesterol": {
            "description": "This fat fuels hormones and heart health. Optimal levels boost energy. Too low, you’re flat; too high, pipes clog. Optimize with training, nuts, and sleep.",
            "clinical_range": "100 - 199",
            "optimal_range": "100 - 190",
            "units": "mg/dL",
            "panel": "Lipid Panel"
        },
        "HDL": {
            "description": "HDL clears junk as ‘good’ cholesterol. Optimizing it sharpens stamina. Low drags you; high’s a win. Boost it with cardio, olive oil, and rest.",
            "clinical_range": "50 - 150",
            "optimal_range": "60 - 150",
            "units": "mg/dL",
            "panel": "Lipid Panel"
        },
        "LDL (calculated)": {
            "description": "LDL, the ‘bad’ cholesterol, rises post-menopause. Optimal levels keep energy up. High slows you; low’s rare. Keep it low with lifts, oats, and sleep.",
            "clinical_range": "0 - 129",
            "optimal_range": "0 - 110",
            "units": "mg/dL",
            "panel": "Lipid Panel"
        },
        "Triglycerides": {
            "description": "Triglycerides store energy. Optimizing them keeps you lean. High piles fat; low saps fuel. Maintain it with training, fish oil, and rest.",
            "clinical_range": "0 - 149",
            "optimal_range": "0 - 120",
            "units": "mg/dL",
            "panel": "Lipid Panel"
        },
        "VLDL (calculated)": {
            "description": "VLDL hauls triglycerides. Optimal levels mean clean blood. High bogs you; low’s fine. Keep it steady with lifts, lean meats, and sleep.",
            "clinical_range": "5.0 - 40.0",
            "optimal_range": "5.0 - 20.0",
            "units": "mg/dL",
            "panel": "Lipid Panel"
        },
        "Total Cholesterol/HDL Ratio": {
            "description": "This ratio gauges heart risk, key post-menopause. Optimizing it lifts vigor. High tires you; low’s a champ. Balance it with cardio, chia, and rest.",
            "clinical_range": "0.0 - 4.4",
            "optimal_range": "0.0 - 3.5",
            "units": "ratio",
            "panel": "Lipid Panel"
        },
        "LDL/HDL Ratio": {
            "description": "This cholesterol showdown affects arteries. Optimal levels mean strength. High slows you; low’s smooth. Optimize with training, nuts, and sleep.",
            "clinical_range": "0.0 - 3.2",
            "optimal_range": "0.0 - 2.0",
            "units": "ratio",
            "panel": "Lipid Panel"
        },
        "Estradiol, Sensitive / Ultrasensitive (LC/MS)": {
            "description": "This precise test tracks low E crucial for HRT or bones. Optimizing it steadies mood and joints. Too high, bloat hits; too low, energy tanks. Dial it with lifts, flaxseeds, and rest.",
            "clinical_range": "5.9 - 54.0",
            "optimal_range": "15.0 - 25.0",
            "units": "pg/mL",
            "panel": "Hormone, Gonadotropin & Neurosteroid Panel"
        },
        "Cortisol": {
            "description": "The stress beast affects metabolism. Optimal levels keep you calm and strong. High eats muscle; low leaves you flat. Tame it with yoga, ashwagandha, and sleep. Marker is for 8 AM collection.",
            "clinical_range": "6.2 - 19.4",
            "optimal_range": "10.0 - 15.0",
            "units": "µg/dL",
            "panel": "Hormone, Gonadotropin & Neurosteroid Panel"
        },
        "TSH": {
            "description": "TSH controls thyroid pace, vital post-menopause. Optimizing it boosts energy and metabolism. Too low, you’re sluggish; too high, jitters hit. Steady it with cardio, seaweed, and rest.",
            "clinical_range": "0.45 - 4.5",
            "optimal_range": "0.5 - 2.5",
            "units": "mIU/L",
            "panel": "Thyroid, Growth Factors & Glucose"
        },
        "ApoB": {
            "description": "ApoB tracks risky particles, rising post-menopause. Optimizing it cuts cardio risk. High drags stamina; low’s a win. Stay optimal with cardio, avocado, and rest.",
            "clinical_range": "40.0 - 125.0",
            "optimal_range": "60.0 - 80.0",
            "units": "mg/dL",
            "panel": "Lipid Panel"
        },
        "Lipoprotein (a)": {
            "description": "This genetic heart risk climbs post-menopause. Optimizing it protects arteries. High tires you long-term; low’s rare. Fight it with training, niacin-rich foods, and sleep.",
            "clinical_range": "0.0 - 75.0",
            "optimal_range": "0.0 - 30.0",
            "units": "nmol/L",
            "panel": "Lipid Panel"
        },
        "Ferritin": {
            "description": "Ferritin stores iron, with overload risk post-menopause. Optimizing it fuels lifts safely. Too low, you’re winded; too high, rust creeps in. Balance it with lifts, beef, and sleep.",
            "clinical_range": "20.0 - 250.0",
            "optimal_range": "50.0 - 120.0",
            "units": "ng/mL",
            "panel": "Iron Markers"
        },
        "Iron": {
            "description": "Iron powers oxygen, but excess looms post-menopause. Optimal levels lift stamina. Low leaves you breathless; high oxidizes. Steady it with lifts, spinach, and rest.",
            "clinical_range": "27.0 - 159.9",
            "optimal_range": "60 - 110.0",
            "units": "µg/dL",
            "panel": "Iron Markers"
        },
        "Transferrin Saturation": {
            "description": "This shows iron transport, key post-menopause. Optimizing it boosts energy delivery. Too low, you’re weak; too high, overload hits. Maintain it with lifts, vitamin C (berries), and sleep.",
            "clinical_range": "15.0 - 55.0",
            "optimal_range": "25.0 - 40.0",
            "units": "%",
            "panel": "Iron Markers"
        },
        "TIBC (Total Iron Binding Capacity)": {
            "description": "TIBC tracks iron-binding capacity. Optimal levels mean smooth transport. Off-balance, you’re tired. Optimize with training, balanced iron, and rest.",
            "clinical_range": "250 - 450",
            "optimal_range": "280 - 340",
            "units": "µg/dL",
            "panel": "Iron Markers"
        },
        "UIBC (Unsaturated Iron Binding Capacity)": {
            "description": "UIBC measures iron reserve capacity. Optimizing it steadies iron flow. Too low or high, energy wanes. Keep it steady with lifts, lean protein, and sleep.",
            "clinical_range": "112 - 347",
            "optimal_range": "180 - 240",
            "units": "µg/dL",
            "panel": "Iron Markers"
        },
        "C-Reactive Protein, High Sensitivity (hsCRP)": {
            "description": "hsCRP flags inflammation, crucial post-menopause. Optimal levels mean cool vibes. High slows recovery; low’s a win. Reduce it with training, turmeric, and rest.",
            "clinical_range": "0.0 - 3.0",
            "optimal_range": "0.0 - 1.0",
            "units": "mg/dL",
            "panel": "Inflammatory Marker"
        }
    }
}
